# FormatOptions Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FormatOptions Constructor
FormatOptions Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FormatOptions()()()() | Creates a new FormatOptions object that represents default formatting. |
| FormatOptions(ForgeTypeId) | Creates a new FormatOptions object that represents custom formatting. |
| FormatOptions(FormatOptions) | Creates a copy of a FormatOptions object. |
| FormatOptions(ForgeTypeId, ForgeTypeId) | Creates a new FormatOptions object that represents custom formatting. |

# See Also
FormatOptions Class
FormatOptions Members
Autodesk.Revit.DB Namespace